#№1
#
# num_1 = int(input('Введите число:'))
# n1 = num_1 // 100000
#
#
# n2 = (num_1 // 10000) % 10
#
#
# n3 = ((num_1 // 1000) % 100 ) % 10
#
#
# n4 = ((num_1 // 100) % 100) % 10
#
#
# n5 = ((num_1 // 10) % 100) % 10
#
#
# n6 = ((num_1 % 100) % 10)
#
# if n1 + n2 + n3 == n4 + n5 + n6:
#     print('Это счастливое число')
# elif n1 + n2 + n3 != n4 + n5 + n6:
#     print('Это не счастливое число')

#№2

# num_1 = int(input('Введите число:'))
# n1 = num_1 // 100000
#
# n2 = (num_1 // 10000) % 10
#
# n3 = ((num_1 // 1000) % 100 ) % 10
#
# n4 = ((num_1 // 100) % 100) % 10
#
# n5 = ((num_1 // 10) % 100) % 10
#
# n6 = ((num_1 % 100) % 10)
#
#
# nubmer = n6 * 100000 + n2 * 10000 + n3 * 1000 + n4 * 100 + n5 * 10 + n1
# print(nubmer)

#№3

# month = int(input('Введите месяц 1/12:'))
# if 2<= month ==1:
#     print('Зима')
# elif 3<= month ==5:
#     print('Весна')
# elif 6<= month ==8:
#     print('Лето')
# elif 9<= month ==11:
#     print('Осень')
# elif month == 12:
#     print('Зима')
